// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.
//a = 5; b = 7 -> max = 7
//a = 2 b = 10 -> max = 10
//a = -9 b = -3 -> max = -3
//Console.WriteLine("Hello, World!");

var a =5;
var b = 6;
if(b > a)
  Console.WriteLine("b больше");
else
  Console.WriteLine("a больше");
